Autodesk.Revit.DB.SaveAsOptions.SetWorksharingOptions(Autodesk.Revit.DB.WorksharingSaveAsOptions)
Sets Worksharing options for SaveAs.
worksharingOptions:
Must be null for a non-workshared model.
Allowed to be null for a workshared model,
in which case default values for WorksharingSaveAsOptions are used.
Since:
2014

Autodesk.Revit.DB.SaveAsOptions.GetWorksharingOptions
Gets Worksharing options for SaveAs.
Returns:
Defaults to null.
For a workshared model, if null default values for WorksharingSaveAsOptions are used.
Since:
2014

Autodesk.Revit.DB.SaveAsOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SaveAsOptions.Compact
Default is false: let the OS eliminate as much or as little dead data as it wants to.
True: force the OS to eliminate all dead data from the file on disk.
Since:
2014

Autodesk.Revit.DB.SaveAsOptions.MaximumBackups
The maximum number of backups to keep on disk.
Remarks:
Non-workshared models have whole-file backups, sequentially numbered.
File-based workshared models have eager, incremental backups
in a backup folder adjacent to the model itself:
Every save backs up all changed data and avoids recopying unchanged elements,
so the latest backup is equivalent to the main copy on disk and
the backup folder does not have huge amounts of redundant data.
A positive number means to keep at most that many backups.
The default value of -1 means to use Revit's defaults:
3 for non-workshared, 20 for workshared.
After initialization, the setter can be used to choose a positive number,
but cannot be used to restore this default value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The requested number of backups is out of range.
Since:
2014

Autodesk.Revit.DB.SaveAsOptions.PreviewViewId
The view id that will be used to generate the preview; this id is not saved to the document's permanent settings.
Remarks:
If this id is set to a view id, the indicated view will be used to generate the preview even if
DocumentPreviewSettings.PreviewViewId is also set.
The id must be valid for use as a preview view (check DocumentPreviewSettings.IsValidPreviewViewId()).
Revit does not check validity when setting this value, only when the options are used in a call to SaveAs().
Default is InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.SaveAsOptions.OverwriteExistingFile
Identifies if the operation should be able to overwrite an existing file.
True if the SaveAs operation should silently overwrite an existing target file, if it exists.
False if the operation should fail if there is already a file at the target location.  Default is false.
Since:
2012

Autodesk.Revit.DB.SaveAsOptions.#ctor
Default constructor.
Since:
2012

Autodesk.Revit.DB.SaveAsOptions
This class contains options available for saving a document to disk with a new filename.
Since:
2012